-- liquibase formatted sql
-- changeset task:1 failOnError:true
CREATE TABLE `task`
(
    `id`                   int NOT NULL AUTO_INCREMENT,
    `correct_answer`       varchar(255) DEFAULT NULL,
    `programming_language` varchar(255) DEFAULT NULL,
    `question`             varchar(255) DEFAULT NULL,
    `wrong_answer`         varchar(255) DEFAULT NULL,
    PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=11 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci

-- changeset task:2 failOnError:true
INSERT INTO task (correct_answer, programming_language, question, wrong_answer)
VALUES ('Правильна відповідь', 'java', '1 питання?', 'Не правильна відповідь'),
       ('Правильна відповідь', 'java', '2 питання?', 'Не правильна відповідь'),
       ('Правильна відповідь', 'java', '3 питання?', 'Не правильна відповідь'),
       ('Правильна відповідь', 'java', '4 питання?', 'Не правильна відповідь'),
       ('Правильна відповідь', 'java', '5 питання?', 'Не правильна відповідь'),
       ('Правильна відповідь', 'java', '6 питання?', 'Не правильна відповідь'),
       ('Правильна відповідь', 'java', '7 питання?', 'Не правильна відповідь'),
       ('Правильна відповідь', 'java', '8 питання?', 'Не правильна відповідь'),
       ('Правильна відповідь', 'java', '9 питання?', 'Не правильна відповідь'),
       ('Правильна відповідь', 'java', '10 питання?', 'Не правильна відповідь'),
       ('Правильна відповідь', 'java', '11 питання?', 'Не правильна відповідь'),
       ('Правильна відповідь', 'java', '12 питання?', 'Не правильна відповідь'),
       ('Правильна відповідь', 'java', '13 питання?', 'Не правильна відповідь'),
       ('Правильна відповідь', 'java', '14 питання?', 'Не правильна відповідь'),
       ('Правильна відповідь', 'java', '15 питання?', 'Не правильна відповідь'),
       ('Правильна відповідь', 'java', '16 питання?', 'Не правильна відповідь'),
       ('Правильна відповідь', 'java', '17 питання?', 'Не правильна відповідь'),
       ('Правильна відповідь', 'java', '18 питання?', 'Не правильна відповідь');

-- changeset task:3 failOnError:true
INSERT INTO task (correct_answer, programming_language, question, wrong_answer)
VALUES ('Правильна відповідь', 'c#', '19 питання?', 'Не правильна відповідь'),
       ('Правильна відповідь', 'c#', '20 питання?', 'Не правильна відповідь'),
       ('Правильна відповідь', 'c#', '21 питання?', 'Не правильна відповідь'),
       ('Правильна відповідь', 'c#', '22 питання?', 'Не правильна відповідь'),
       ('Правильна відповідь', 'c#', '23 питання?', 'Не правильна відповідь'),
       ('Правильна відповідь', 'c#', '24 питання?', 'Не правильна відповідь'),
       ('Правильна відповідь', 'c#', '25 питання?', 'Не правильна відповідь'),
       ('Правильна відповідь', 'c#', '26 питання?', 'Не правильна відповідь'),
       ('Правильна відповідь', 'c#', '27 питання?', 'Не правильна відповідь'),
       ('Правильна відповідь', 'c#', '28 питання?', 'Не правильна відповідь'),
       ('Правильна відповідь', 'c#', '29 питання?', 'Не правильна відповідь'),
       ('Правильна відповідь', 'c#', '30 питання?', 'Не правильна відповідь'),
       ('Правильна відповідь', 'c#', '31 питання?', 'Не правильна відповідь'),
       ('Правильна відповідь', 'c#', '32 питання?', 'Не правильна відповідь'),
       ('Правильна відповідь', 'c#', '33 питання?', 'Не правильна відповідь'),
       ('Правильна відповідь', 'c#', '34 питання?', 'Не правильна відповідь'),
       ('Правильна відповідь', 'c#', '35 питання?', 'Не правильна відповідь'),
       ('Правильна відповідь', 'c#', '36 питання?', 'Не правильна відповідь'),
       ('Правильна відповідь', 'c#', '37 питання?', 'Не правильна відповідь'),
       ('Правильна відповідь', 'c#', '38 питання?', 'Не правильна відповідь');

-- changeset task:4 failOnError:true
INSERT INTO task (correct_answer, programming_language, question, wrong_answer)
VALUES ('Правильна відповідь', 'c', '39 питання?', 'Не правильна відповідь'),
       ('Правильна відповідь', 'c', '40 питання?', 'Не правильна відповідь'),
       ('Правильна відповідь', 'c', '41 питання?', 'Не правильна відповідь'),
       ('Правильна відповідь', 'c', '42 питання?', 'Не правильна відповідь'),
       ('Правильна відповідь', 'c', '43 питання?', 'Не правильна відповідь'),
       ('Правильна відповідь', 'c', '44 питання?', 'Не правильна відповідь'),
       ('Правильна відповідь', 'c', '45 питання?', 'Не правильна відповідь'),
       ('Правильна відповідь', 'c', '46 питання?', 'Не правильна відповідь'),
       ('Правильна відповідь', 'c', '47 питання?', 'Не правильна відповідь'),
       ('Правильна відповідь', 'c', '48 питання?', 'Не правильна відповідь'),
       ('Правильна відповідь', 'c', '49 питання?', 'Не правильна відповідь'),
       ('Правильна відповідь', 'c', '50 питання?', 'Не правильна відповідь'),
       ('Правильна відповідь', 'c', '51 питання?', 'Не правильна відповідь'),
       ('Правильна відповідь', 'c', '52 питання?', 'Не правильна відповідь'),
       ('Правильна відповідь', 'c', '53 питання?', 'Не правильна відповідь'),
       ('Правильна відповідь', 'c', '54 питання?', 'Не правильна відповідь'),
       ('Правильна відповідь', 'c', '55 питання?', 'Не правильна відповідь'),
       ('Правильна відповідь', 'c', '56 питання?', 'Не правильна відповідь'),
       ('Правильна відповідь', 'c', '57 питання?', 'Не правильна відповідь'),
       ('Правильна відповідь', 'c', '58 питання?', 'Не правильна відповідь');

-- changeset task:5 failOnError:true
INSERT INTO task (correct_answer, programming_language, question, wrong_answer)
VALUES ('Правильна відповідь', 'js', '59 питання?', 'Не правильна відповідь'),
       ('Правильна відповідь', 'js', '60 питання?', 'Не правильна відповідь'),
       ('Правильна відповідь', 'js', '61 питання?', 'Не правильна відповідь'),
       ('Правильна відповідь', 'js', '62 питання?', 'Не правильна відповідь'),
       ('Правильна відповідь', 'js', '63 питання?', 'Не правильна відповідь'),
       ('Правильна відповідь', 'js', '64 питання?', 'Не правильна відповідь'),
       ('Правильна відповідь', 'js', '65 питання?', 'Не правильна відповідь'),
       ('Правильна відповідь', 'js', '66 питання?', 'Не правильна відповідь'),
       ('Правильна відповідь', 'js', '67 питання?', 'Не правильна відповідь'),
       ('Правильна відповідь', 'js', '68 питання?', 'Не правильна відповідь'),
       ('Правильна відповідь', 'js', '69 питання?', 'Не правильна відповідь'),
       ('Правильна відповідь', 'js', '70 питання?', 'Не правильна відповідь'),
       ('Правильна відповідь', 'js', '71 питання?', 'Не правильна відповідь'),
       ('Правильна відповідь', 'js', '72 питання?', 'Не правильна відповідь'),
       ('Правильна відповідь', 'js', '73 питання?', 'Не правильна відповідь'),
       ('Правильна відповідь', 'js', '74 питання?', 'Не правильна відповідь'),
       ('Правильна відповідь', 'js', '75 питання?', 'Не правильна відповідь'),
       ('Правильна відповідь', 'js', '76 питання?', 'Не правильна відповідь'),
       ('Правильна відповідь', 'js', '77 питання?', 'Не правильна відповідь');

/*
-- rollback
DROP TABLE user;
*/
